[M_Nast_Easter:100_FollowVarkid MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock has summoned you to [place]Wam Bam Island[-place] for a weekend of fun. Unfortunately, he was kidnapped by some sort of creature about a half-second after you met up with him.<br><br>Mordecai has come up with a way to track him down: just inject some of Hammerlock's scent into another varkid pod, and it'll lead you right to Hammerlock.<br><br>Having just turned another varkid into a de facto bloodhound, you just need to follow him and rescue Hammerlock."

[M_Nast_Easter:110_SummonBoss MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock has summoned you to [place]Wam Bam Island[-place] for a weekend of fun. Unfortunately, he was kidnapped by some sort of creature about a half-second after you met up with him.<br><br>As it turns out, Hammerlock has been kidnapped by a malevolent monster known as the Son of Crawmerax. Before freeing Hammerlock, you'll need to summon this Crawmerax thing and kill the hell out of it."

[M_Nast_Easter:130_RescueHammerlock MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock has summoned you to [place]Wam Bam Island[-place] for a weekend of fun. Unfortunately, he was kidnapped by some sort of creature about a half-second after you met up with him.<br><br>As it turns out, Hammerlock was been kidnapped by a malevolent monster known as the Son of Crawmerax. You killed that thing, though, and so Sir Hammerlock is now ripe for the rescuing."

[M_Nast_Easter:30_FindVarkidEggSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Inject Hammerlock's scent into a varkid pod. "
MissionDescriptionOverride="Sir Hammerlock has summoned you to [place]Wam Bam Island[-place] for a weekend of fun. Unfortunately, he was kidnapped by some sort of creature about a half-second after you met up with him.<br><br>Mordecai has come up with a way to track him down: just inject some of Hammerlock's scent into a varkid pod, and it'll lead you right to Hammerlock."

[M_Nast_Easter:50_FollowVarkidSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock has summoned you to [place]Wam Bam Island[-place] for a weekend of fun. Unfortunately, he was kidnapped by some sort of creature about a half-second after you met up with him.<br><br>Mordecai has come up with a way to track him down: just inject some of Hammerlock's scent into a varkid pod, and it'll lead you right to Hammerlock.<br><br>You've injected a pod with Hammerlock's scent -- now just follow the hatched varkid."

[M_Nast_Easter:54_FindVarkidEggSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock has summoned you to [place]Wam Bam Island[-place] for a weekend of fun. Unfortunately, he was kidnapped by some sort of creature about a half-second after you met up with him.<br><br>Mordecai has come up with a way to track him down: just inject some of Hammerlock's scent into a varkid pod, and it'll lead you right to Hammerlock."

[M_Nast_Easter:58_FollowVarkidSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock has summoned you to [place]Wam Bam Island[-place] for a weekend of fun. Unfortunately, he was kidnapped by some sort of creature about a half-second after you met up with him.<br><br>Mordecai has come up with a way to track him down: just inject some of Hammerlock's scent into a varkid pod, and it'll lead you right to Hammerlock.<br><br>You've injected a pod with Hammerlock's scent -- now just follow the hatched varkid."

[M_Nast_Easter:60_FindPathtoIsland MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock has summoned you to [place]Wam Bam Island[-place] for a weekend of fun. Unfortunately, he was kidnapped by some sort of creature about a half-second after you met up with him.<br><br>Mordecai has come up with a way to track him down: just inject some of Hammerlock's scent into a varkid pod, and it'll lead you right to Hammerlock.<br><br>The varkid you were following has disappeared into a tunnel of some sort. You'll need to find a way to restore power to the tunnel so you can keep following it."

[M_Nast_Easter:65_KillThreshers MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock has summoned you to [place]Wam Bam Island[-place] for a weekend of fun. Unfortunately, he was kidnapped by some sort of creature about a half-second after you met up with him.<br><br>Mordecai has come up with a way to track him down: just inject some of Hammerlock's scent into a varkid pod, and it'll lead you right to Hammerlock.<br><br>The varkid you were following has disappeared into a tunnel of some sort. You'll need to find a way to restore power to the tunnel so you can keep following it. For now, though, you'll have to kill a few pirates."

[M_Nast_Easter:70_StartWheel MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock has summoned you to [place]Wam Bam Island[-place] for a weekend of fun. Unfortunately, he was kidnapped by some sort of creature about a half-second after you met up with him.<br><br>Mordecai has come up with a way to track him down: just inject some of Hammerlock's scent into a varkid pod, and it'll lead you right to Hammerlock. The varkid you were following has disappeared into a tunnel of some sort. You'll need to find a way to restore power to the tunnel so you can keep following it. Brick has informed you that starting up the water wheel will restore power to the tunnel."

[M_Nast_Easter:80_FollowVarkid2 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock has summoned you to [place]Wam Bam Island[-place] for a weekend of fun. Unfortunately, he was kidnapped by some sort of creature about a half-second after you met up with him.<br><br>Mordecai has come up with a way to track him down: just inject some of Hammerlock's scent into another varkid pod, and it'll lead you right to Hammerlock.<br><br>You just caught up to the varkid you were following. Keep going, and it should lead you to Hammerlock."

[M_Nast_Easter:85_KeepFollowingVarkid MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock has summoned you to [place]Wam Bam Island[-place] for a weekend of fun. Unfortunately, he was kidnapped by some sort of creature about a half-second after you met up with him.<br><br>Mordecai has come up with a way to track him down: just inject some of Hammerlock's scent into another varkid pod, and it'll lead you right to Hammerlock.<br><br>You just caught up to the varkid you were following. Keep going, and it should lead you to Hammerlock."

[M_Nast_Easter:90_FindAnotherEgg MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock has summoned you to [place]Wam Bam Island[-place] for a weekend of fun. Unfortunately, he was kidnapped by some sort of creature about a half-second after you met up with him.<br><br>Mordecai has come up with a way to track him down: just inject some of Hammerlock's scent into another varkid pod, and it'll lead you right to Hammerlock."

[M_Nast_Easter:FindEgg MissionObjectiveDefinition]
ProgressMessage="Find some varkids"

[M_Nast_Easter:FindEgg2 MissionObjectiveDefinition]
ProgressMessage="Find another varkid pod"

[M_Nast_Easter:FollowVarkid MissionObjectiveDefinition]
ProgressMessage="Follow varkid"

[M_Nast_Easter:FollowVarkid2 MissionObjectiveDefinition]
ProgressMessage="Follow varkid"

[M_Nast_Easter:FollowVarkid2Pt2 MissionObjectiveDefinition]
ProgressMessage="Follow badass varkid"

[M_Nast_Easter:InjectBigEgg MissionObjectiveDefinition]
ProgressMessage="Inject big varkid pod"

[M_Nast_Easter:InjectEgg MissionObjectiveDefinition]
ProgressMessage="Inject varkid pod"

[M_Nast_Easter:KillVarkid MissionObjectiveDefinition]
ProgressMessage="Kill varkid"

[M_Nast_Easter:LookForNeedle MissionObjectiveDefinition]
ProgressMessage="Find varkid pod injector"

[M_Nast_Easter:RestoreTubePower MissionObjectiveDefinition]
ProgressMessage="Power up water wheel"
